# BuildingUnoccupiedCoolingSetPointParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BuildingUnoccupiedCoolingSetPointParam Property
ParameterTypeId Class See Also
---
"Unoccupied Cooling Set Point"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BuildingUnoccupiedCoolingSetPointParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BuildingUnoccupiedCoolingSetPointParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BuildingUnoccupiedCoolingSetPointParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace